quiz_data = [
    {
        'question': 'Что такое Python?',
        'options': ['Язык программирования', 'Тип данных', 'Музыкальный инструмент', 'Змея на английском'],
        'correct_option': 0
    },
    {
        'question': 'Какой тип данных используется для хранения целых чисел?',
        'options': ['int', 'float', 'str', 'natural'],
        'correct_option': 0
    },
    {
        'question': 'Необходимо собрать и вывести все уникальные слова из строки рекламного текста. Какой из перечисленных типов данных Python подходит лучше всего?',
        'options': ['кортеж (tuple)', 'список (list)', 'множество (set)', 'словарь (dict)'],
        'correct_option': 2
    },
    {
        'question': 'Как вывести список методов и атрибутов объекта x',
        'options': ['help(x)', 'info(x)', '?x', 'dir(x)'],
        'correct_option': 3
    },
    {
        'question': 'Как получить данные от пользователя?',
        'options': ['read()', 'get()', 'cin()', 'input()'],
        'correct_option': 3
    },
    {
        'question': 'Какая функция выводит что-либо в консоль (на экран монитора)?',
        'options': ['out()', 'log()', 'print()', 'write()'],
        'correct_option': 3
    },
    {
        'question': 'Тело цикла - это...',
        'options': ['группа команд, не входящих в циклическую структуру', 'произвольный текст', 'произвольная группа команд', 'группа команд, повторяющихся некоторое число раз'],
        'correct_option': 3
    },
    {
        'question': 'Переменная float',
        'options': ['целая ', 'вещественная ', 'логическая ', 'булевая '],
        'correct_option': 1
    },
    {
        'question': 'Что будет в результате выполнения следующего действия print (23 % 2)',
        'options': ['1', '10', '8', '0'],
        'correct_option': 0
    },
    {
        'question': 'Результатом вычисления print (25 // 3) будет число:',
        'options': ['10', '8', '8.3', '1'],
        'correct_option': 1
    },
    # Добавьте другие вопросы
]